lucasssvaz/arduino-esp32/libraries/BLE/src/BLEAdvertising.cpp
  // --- Manufacturer data ---
  if (m_advData.manufacturer_len > 0 && m_advData.p_manufacturer_data
      && remaining >= (uint16_t)(2 + m_advData.manufacturer_len)) {
    *p++ = m_advData.manufacturer_len + 1;
    *p++ = ESP_BLE_AD_MANUFACTURER_SPECIFIC_TYPE;
    memcpy(p, m_advData.p_manufacturer_data, m_advData.manufacturer_len);
    p += m_advData.manufacturer_len;
    remaining -= 2 + m_advData.manufacturer_len;
  }

  // --- Service data ---
  if (m_advData.service_data_len > 0 && m_advData.p_service_data
      && remaining >= (uint16_t)(2 + m_advData.service_data_len)) {
    *p++ = m_advData.service_data_len + 1;
    *p++ = ESP_BLE_AD_TYPE_SERVICE_DATA;
    memcpy(p, m_advData.p_service_data, m_advData.service_data_len);
    p += m_advData.service_data_len;
    remaining -= 2 + m_advData.service_data_len;
  }

  // --- Device name (truncated to fit, omitted when name goes in the scan response) ---
  if (includeName) {
    String deviceName = BLEDevice::getDeviceName();
    uint16_t nameLen = deviceName.length();
    if (nameLen > 0 && remaining >= 3) {
      uint16_t maxChars = remaining - 2;
      bool complete = (nameLen <= maxChars);
      uint16_t actualLen = complete ? nameLen : maxChars;
      *p++ = actualLen + 1;
      *p++ = complete ? ESP_BLE_AD_TYPE_NAME_CMPL : ESP_BLE_AD_TYPE_NAME_SHORT;
      memcpy(p, deviceName.c_str(), actualLen);
      p += actualLen;
      remaining -= 2 + actualLen;
    }
  }

  return (uint16_t)(p - buf);
}

void BLEAdvertising::setAdvertisementChannelMap(esp_ble_adv_channel_t channel_map) {
  m_advParams.channel_map = channel_map;
}  // setAdvertisementChannelMap

/**
 * @brief Start advertising.
 * Start advertising.
 * @return N/A.
 */
bool BLEAdvertising::start() {
  log_v(">> start: customAdvData: %d, customScanResponseData: %d, advDataSet: %d", m_customAdvData, m_customScanResponseData, m_advDataSet);

  // If async configuration is already in progress, don't re-enter.
  // The GAP event handler will start advertising when the config completes.
  if (m_advConfiguring) {
    log_w("Advertising configuration already in progress");
    return true;
  }

  // If advertising data needs to be (re)configured, kick off the async configuration.
  // Bluedroid's esp_ble_gap_config_adv_data() is asynchronous and fires a GAP completion
  // event when done. We must NOT block here with semaphores because start() can be called
  // from BT callbacks (e.g., the disconnect handler), and both GATT and GAP callbacks are
  // dispatched on the same BTC task - blocking would deadlock.
  // Instead, we use the same non-blocking approach as NimBLE: kick off the config and let
  // the GAP event handler (handleGAPEvent) chain the remaining steps.
  if (!m_advDataSet) {
    freeServiceUUIDs();

    if (!m_customAdvData) {
      // Always use the raw advertising API to encode service UUIDs in their
      // native compact sizes (16/32/128-bit). When scan response is enabled,
      // the device name is omitted from the advertising packet; it is sent in
      // the scan response instead (configured in handleGAPEvent after the adv
      // data raw set completes).
      uint8_t rawBuf[ESP_BLE_ADV_DATA_LEN_MAX];
      uint16_t rawLen = buildRawAdvData(rawBuf, sizeof(rawBuf), /*includeName=*/!m_scanResp);
      esp_err_t errRc = ::esp_ble_gap_config_adv_data_raw(rawBuf, rawLen);
      if (errRc != ESP_OK) {
        log_e("esp_ble_gap_config_adv_data_raw: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
        return false;
      }
      m_advConfiguring = true;
      return true;
    }

    if (!m_customScanResponseData && m_scanResp) {
      // Custom adv data but auto scan response - configure scan response asynchronously.
      // The GAP event handler will start advertising when config completes.
      if (!configureScanResponseData()) {
        freeServiceUUIDs();
        return false;
      }
      m_advConfiguring = true;
      log_d("Scan response data configuration started (async)");
      return true;
    }

    // Both adv data and scan response are custom (or no scan response needed).
    // No async operations, mark as configured and proceed to start.
    m_advDataSet = true;
    freeServiceUUIDs();
  }

  // Advertising data is already configured, just start advertising.
  esp_err_t errRc = ::esp_ble_gap_start_advertising(&m_advParams);
  if (errRc != ESP_OK) {
    log_e("<< esp_ble_gap_start_advertising: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
  } else {
    log_v("<< start");
  }
  return ESP_OK == errRc;
}  // start

/**
 * @brief Stop advertising.
 * Stop advertising.
 * @return N/A.
 */
bool BLEAdvertising::stop() {
  log_v(">> stop");
  esp_err_t errRc = ::esp_ble_gap_stop_advertising();
  if (errRc != ESP_OK) {
    log_e("esp_ble_gap_stop_advertising: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
  } else {
    log_v("<< stop");
  }
  return ESP_OK == errRc;
}  // stop

void BLEAdvertising::handleGAPEvent(esp_gap_ble_cb_event_t event, esp_ble_gap_cb_param_t *param) {
  log_d("handleGAPEvent [event no: %d]", (int)event);

  switch (event) {
    // Advertising data has been configured. Next step: configure scan response if needed,
    // otherwise start advertising directly. This chains the async operations started by start().
    case ESP_GAP_BLE_ADV_DATA_SET_COMPLETE_EVT:
    {
      log_d("Advertising data set complete, status=%d", param->adv_data_cmpl.status);
      if (param->adv_data_cmpl.status != ESP_BT_STATUS_SUCCESS) {
        log_e("Advertising data set failed, status=%d", param->adv_data_cmpl.status);
        freeServiceUUIDs();
        m_advConfiguring = false;
        break;
      }

      if (!m_customScanResponseData && m_scanResp) {
        if (!configureScanResponseData()) {
          freeServiceUUIDs();
          m_advConfiguring = false;
        }
      } else {
        m_advDataSet = true;
        m_advConfiguring = false;
        freeServiceUUIDs();
        esp_err_t errRc = ::esp_ble_gap_start_advertising(&m_advParams);
        if (errRc != ESP_OK) {
          log_e("esp_ble_gap_start_advertising: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
        }
      }
      break;
    }

    // Scan response data has been configured. Final step: start advertising.
    case ESP_GAP_BLE_SCAN_RSP_DATA_SET_COMPLETE_EVT:
    {
      log_d("Scan response data set complete, status=%d", param->scan_rsp_data_cmpl.status);
      if (param->scan_rsp_data_cmpl.status != ESP_BT_STATUS_SUCCESS) {
        log_e("Scan response data set failed, status=%d", param->scan_rsp_data_cmpl.status);
        freeServiceUUIDs();
        m_advConfiguring = false;
        break;
      }

      m_advDataSet = true;
      m_advConfiguring = false;
      freeServiceUUIDs();
      esp_err_t errRc = ::esp_ble_gap_start_advertising(&m_advParams);
      if (errRc != ESP_OK) {
        log_e("esp_ble_gap_start_advertising: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
      }
      break;
    }

